Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff
aws_instance.backstage_server: Refreshing state... [id=i-090d1afe5ff140928]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_key_pair.pekora-main-keypair will be created
+ resource "aws_key_pair" "pekora-main-keypair" {
      + arn             = (known after apply)
      + fingerprint     = (known after apply)
      + id              = (known after apply)
      + key_name        = "pekora-main-keypair"
      + key_name_prefix = (known after apply)
      + key_pair_id     = (known after apply)
      + public_key      = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDlsYc+hEFl8tF1jPf4BFWOleo7Z/rGSEcB0pD/TNpcQj2jQvOqyy/kkj17FVLqeZCDVCUHc4xpMmC5d2d4t0SW5vGIdz87k/QUe8w/dyoHlTo/oTqI8yw+17FfbHjb2MmRSe1og1DKn6Wd18pn0hRS0ekZ57fO2aE94cDB52qouKwLBiJnjIEttr8nffHCZeuV+z4PSy63s5gGxsECarjBrb4qKKH9EZYXz91Z7cwRWe31J/3g+P/++KH1wt6ehKsBFd//oM0oKNjxGZc3xacY0rWiZ45pH0QNMvJMlg2hNc0ITOPaM5enxcuAS9FZVNSmYBeEViJNpsctKJi8LVxkS/9ujSZmxOrpbcY6k0nTu5scHnLOPyxOA0ZGCWcYvs2FtwwX7hr7v8xO8ksJHCWnZAj+w18DsxtB842yFq2WIXnB77Rg+lXj1knZs9x3o3k3c1pbBc2DBui859oEyqT2/1AyP/uqUZZU6HORvQsVMLIgE3yxcPp99oaM/6v8C00="
      + tags_all        = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d .`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.pekora.dev/lock?id=UsadaPeko%252Finfra-as-a-code%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d .`
</details>
Plan: 1 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
